"use client";
import { useParams } from "next/navigation";
import { useState } from "react";

const Lyrics: React.FC = () => {
  const { id } = useParams();
  const [isCopied, setIsCopied] = useState(false);

  // Match song IDs with their names and lyrics
  const songs = [
    {
      id: 1,
      name: "تیری شان عم نوالہ اللہ جل جلالہ",
      lyrics: ` تیری شان عم نوالہ اللہ جل جلالہ

تیرے پاک نام پہ اے خدا میرا دل فدا میری جاں فدا
میری روح کی یہی غذا تیرا نام لب پہ رہے سدا
ہوتیری رضا میری آرزو اللہ جل جلالہ اللہ جل جلالہ
__________

 تجھے بے نیازی کا واسطہ ہو قبول میری یہ  التجاء
کہ برائے احمد مجتبیٰ ہو معاف میری ہراک خطا
سر حشر رہ جائے آبرو اللہ جل جلالہ اللہ جل جلالہ
_________

جو حساب ر وز حساب ہو نہ سوال ہو نہ جواب ہو  میرے دائیں ہاتھ کتاب ہو
اور لب پہ نعت جناب ہو
میں رہوں حضور کے روبرو اللہ جل جلالہ اللہ جل جلالہ
__________

میں گناہ گار ہوں اے خدا کوئی نیک کام نہ کرسکا
نہیں ہو سکا تیرا حق ادا  تیرا فیض و فضل ہے بے بہا
ہو تیری رضا میری آرزو اللہ جل جلالہ اللہ جل جلالہ
__________

یہ دعا کرو میرے دوستو کہ عطا ہو ذوق یہ نجم کو
کبھی حمد ہو کبھی نعت ہو یہ دعا کرو  ہاں دعا کرو
میری چشم تر رہے باوضو اللہ جل جلالہ اللہ جل جلالہ
__________`,
    },

    {
      id: 2,
      name: "راحت افزا عجب ہے ذکر ترا",
      lyrics: `راحت افزا عجب ہے ذکر ترا
مغفرت کا سبب ہے ذکر ترا
__________

زینت ِ نطق  تیرا اسم عظیم
وجہ تحریک لب ہے ذکر  ترا
__________

وقت کے ہاتھ میں تری تسبیح
گردشِ روز و شب ہے ذکر ترا
__________

بندگی،  حلم،  آگہی،  ایثارہے
دیکھا جائے تو سب ہے ذکر ترا
__________

بے بسی  کی سیاہ راتوں میں
روشنی کا سبب ذکر ترا
__________

جس جا احصا کرے زبانِ بشر
اتنا محدود کب ہے ذکر ترا
__________

تیرے  ارشاد سے ہوا معلوم
ذکر شاہ عرب ہے ذکر ترا
__________

کس کو نسبت ہے تیرے پیاروں سے
اس زمیں کا ادب ہے ذکر ترا
__________

فکرِ شہزادؔ کے لئے لاریب
	باعثِ تاب و تب ہے ذکر ترا
__________`,
    },
    {
      id: 3,
      name: "حاضر ہیں حاضر ہیں حاضر ہیں ہم",
      lyrics: `حاضر ہیں حاضر ہیں حاضر ہیں ہم
لَبَّیْکَ اَللّٰھُمَّ لَبَّیْکَ لَبَّیْکَ لَا  شَرِیْکَ
لَکَ لَبَّیْکَ اِنَّ الْحَمْدَ وَ النَّعْمَۃَ لَکَ
وَ الْمُلْکَ لَا شَرِیْکَ لَکَ
__________

لائق حمد و ثنا  تیرے سوا کوئی نہیں
سننے والا عاصیوں کی التجا کوئی نہیں
ڈوبتوں کو جو بنا دے ناخدا کوئی نہیں 
جھولیاں بھر دے جوسن کے مدعا 
کوئی نہیں 
آسرا تیرے سوا تیرے سوا کوئی 
نہیں 
تر ہے دامن بھی ہمارے اور آنکھیں 
بھی ہیں نم 
حاضر ہیں حاضر ہیں حاضر ہیں ہم 
__________

یہ شرف کہ آدمی اللہ کے گھر جائے گا
یہ شرف کہ پاک دامن کا وہ رتبہ پائے گا
یہ شرف کہ داغ ِ دامن بھی ہر اک دھل جائے گا
یہ شرف کہ ہر خطا رب در گزر فرمائے گا
یہ شرف کہ روضۂ شاہِ امم پر جائے گا
اس شرف پہ جان بھی قربان کر دے تو ہے کم
حاضر ہیں حاضر ہیں حاضر ہیں ہم
__________

یہ سفر حج کا سفر  بگڑے بناتا ہے نصیب
یہ سفر مخلوق کو خالق سے کرتا 
ہے قریب 
یہ سفر یعنی مریضوں سے ملاقات ِ 
طبیب
ہو مقدر سے اگر عرفات کا میدان نصیب
یہ دعا مانگو کھڑے ہو کر وہاں پر اے ادیبؔ
ہو غلام ِ مصطفیٰ میں نام اپنا بھی رقم
حاضر ہیں حاضر ہیں حاضر ہیں ہم
__________`,
    },
    {
      id: 4,
      name: "يا رب العلمين ﷲ ہو ﷲ",
      lyrics: `يا رب العلمين ﷲﷲ
صل على طه الامين ﷲﷲ
في كل وقت و حين ﷲﷲ
__________

إملأ قلبي باليقين ﷲﷲ
ثبتني على ه‍ذا الدين ﷲﷲ
واغفر لي و المسلمين ﷲﷲ
__________

حسبي ربي جل ﷲﷲ
ما في قلبي غير ﷲﷲ 
على اله‍ادي صلى ﷲﷲ
لااله الاالله ﷲﷲ
__________`,
    },
    {
      id: 5,
      name: "وہ تنہا کون ہے اﷲ ہو ﷲ",
      lyrics: `وہ تنہا کون ہے ﷲ ہو ﷲ
بادشاہ وہ کون ہے ﷲ ہو ﷲ
مہربان وہ کون ہے ﷲ ہو ﷲ
__________

کیا اونچی شان ہے ﷲ ہو ﷲ
سب دلوں کی جان ہے ﷲ ہو ﷲ
اس کے سب نشان ہے ﷲ ہو ﷲ
__________`,
    },
    {
      id: 6,
      name: "اللہ کے گھر میں ہوں",
      lyrics: `اللہ نے بلایا ہے اللہ کے گھر میں ہوں
کعبے کا نظارہ ہے اللہ کے گھر میں ہوں
__________

دربار یہ کیسا ہے پیشانی سے پہلے 
دل
سجدے میں جھکایا اللہ کے گھر 
میں ہوں
__________

وہ رکن یمانی ہو یا رکن عراقی ہو
ہر کونےکو چوما ہے اللہ کے گھر میں ہوں
__________

مہمان خدا کے ہیں اب فکر نہیں 
کوئی
اللہ نے کھلانا ہے اللہ کے گھر میں 
ہوں
__________

مرکز ہے ہدایت کا یہ کعبہ مبارک گھر
دنیا میں جو پہلا ہے اللہ کے گھر میں ہوں
__________

یہ نقش براہیمی دیکھا تو مچل اٹھے 
مؤمن کا مصلہ ہے اللہ کے گھر میں 
ہوں
__________

یہ وقت ہے عزت کا میزاب ہے رحمت کا
سرپہ یہی سایہ ہے اللہ کے گھر میں ہوں
__________

جس سمت نظر اٹھی اک نور نظر آیا
پُر نور نظارہ ہے اللہ کے گھر میں ہوں
__________

 اللہ کرم کرنا  ہر سال بلا لینا
ہر دل کی تمنا ہے اللہ کے گھر میں 
ہوں
__________

یہ پاک حرم جس مین سارے ہی نبی آئے
کیا خوب نصیبا ہے اللہ کے گھر میں ہوں
__________

سجدے میں اجاگرؔ ہے اور سامنے 
کعبہ ہے
مولا نے نوازا ہے اللہ کے گھر میں 
ہوں
__________`,
    },
    {
      id: 7,
      name: "کعبہ دکھا دے مولا",
      lyrics: `ہر آنکھ چاہتی ہے کعبہ دکھا دے مولا
حسرت پکارتی ہے کعبہ دکھا دے مولا
__________

کوہ ِصفا سے دوڑوں مروہ کی چوٹیوں تک
خواہش مچل رہی ہے کعبہ دکھا دے مولا
__________

احرام پھر پہن کر طوفِ حرم کروں میں
میری دعا یہی ہے کعبہ دکھا دے مولا
__________

مینار اونچے اونچے دکھلا دے  تو حرم کے
پستی میں زندگی ہے کعبہ دکھا دے مولا
__________

یادِ حرم میں آنسو بہنیں کو رو رہے ہیں
اک آگ سی لگی ہے کعبہ دکھا دے مولا
__________

حالات کا ہوں مارا دامن میرا ہے خالی
اسباب کی کمی ہے کعبہ دکھا دے مولا
__________

یہ ملتزم سے جا کر لپٹتا رہے اجاگرؔ
یہ آرزو بڑی ہے کعبہ دکھا دے مولا
`,
    },
    {
      id: 8,
      name: "مرے مولا میں حاضر ہوں",
      lyrics: `چلا آیا ہوں تیرے گھر مرے مولا میں حاضرہوں
صدا لبیک کی لب پر مرے مولا میں حاضرہوں
__________

مرے آنسو ہیں فریادی مری آہیں سسکتی ہیں
مجھے بھی بخش دے داور مرے مولا میں حاضرہوں
__________

حطیمِ پاک کانہ خدا کا ایک حصہ ہے
میں آیا ہوں کعبے کے اندر مرے مولا میں حاضرہوں
__________

غلافِ کعبہ ہاتھوں میں پکڑ کر یہ دعا مانگی
کبھی چھوٹے نہ تیرا در مرے مولا میں حاضرہوں
__________

نکل آئے کوئی  صورت میری بخشش کی یا اللہ
حرم میں ہو کرم مجھ پر مرے مولا میں حاضرہوں
__________

مطافِ کعبہ میں ہوں اور چھما چھم بارشیں ہیں
دکھا ہر سال یہ منظر مرے مولا میں حاضرہوں
__________

کرم کی بارشوں میں سر جھکانا مانگنا رب سے
رہے گا یا د یہ منظر مرے مولا میں حاضرہوں
__________

گناہوںمیں بسر کی زندگی ہائے پشماں ہوں
جھکائے سر بچشم تر مرے مولا میں حاضرہوں
__________

نظر پہلی پڑی کعبے پہ اپنے رب سے یہ مانگا
مری موت ہو ایماں پر مرے مولا میں حاضرہوں
__________

اجاگرؔ نے  تجھے پایا تو اس نے پا لیا سب کچھ
رضا تیری مرا زیور مرے مولا میں حاضرہوں
`,
    },

    {
      id: 101,
      name: "الصُّبْحُ بدَا مِنْ طَلْعَتِہ",
      lyrics: `الصُّبْحُ بدَا مِنْ طَلْعَتِہ
والليلُ دجا من وفرتہ
__________

فاقَ الرُّسالۃ فضلاً وعلا
اَھْدَى السُّبُلاَ لِدَلالَتِہ
__________

كَنْزُ الْكَرَمِ مُوْلِي النِّعَم
ھادي الاممِ لشريعتہ
__________

اذكى النسبِ اعلى الحسب
كُلُّ العَرَبِ في خِدمَتِہ
__________

سَعَتِ الشَّجَرُ نَطَقَ الحَجَرُ
شُقّ القَمَرُ بِاِشَارتِہ
__________

جِبْرِيلُ اَتَى لَيْلَۃ َ اَسْرَى
والرَّبُ دعی لحضرتہ
__________

نالَ الشَّرَفَا واللہ عَفَا
عن ما سلفا من امتہ
__________

فمحمدُنا ھوَ سيدُنا
والعِزُّ لَنا لاِجَابتِہ`,
    },

    {
      id: 102,
      name: "چوں ماہ در ارض و سماں",
      lyrics: `چوں ماہ در ارض و سماں، تاباں توئی، تاباں توئی
رشک ملک، نور خدا، انسان توئی، انسان توئی
__________

روشن ز رویت دو جہان، عکس رخت خورشید وماہ
اے نور ذات کبریا رخشا توئی، رخشاں توئی
__________

آیات قرآن ابرویت، تفسیر قرآں گیسویت
اے روئے تو قرآن ما، ایمان توئی، ایمان توئی
__________

یا مصطفی یا مجتبی، ارحم لنا، ارحم لنا
دست ہوا بے چارا ارا، داماں توئی، داماں توئی
__________

من عاصیم، من عاجزم،من بیکسم حال میرا
یا شافعی زور جزا، پر ساں توئی، پر ساں توئی
__________

جامیؔ رود از چشم ما جلوہ نما بہر خدا
جان و دلم ہر دو فدا، جاناں توئی، جاناں توئی 
` },

    {
      id: 103,
      name: "رفعت عرش سے بھی رتبہ ہے بالا تیرا",
      lyrics: `رفعت عرش سے بھی رتبہ ہے بالا تیرا
ورفعنا سے عیاں ، ذکر ہے اونچا تیرا
__________

سورج الٹایا اشارے سے قمر چیر دیا
ملک ہر شے ہے تری کل پہ ہے قبضہ تیرا
__________

کعبہ وعرش سے اعلیٰ، ہے جناں سے بالا
رفعتیں رشک کریں جس پہ وہ روضہ تیرا
__________

تشنگی دور ہو، سیرابی سدا کی ہو نصیب
حوض کوثر سے ملے جس کو قطرہ تیرا
__________

پیکر نورکی یہ شان کے سایہ نہ بنا
خلق نے پایا مگر فضل کا سایہ تیرا
__________

تیری تقسیم سے بٹتی ہے جہاں میں نعمت
دینے والا ہے خدا، بانٹنا عہدہ تیرا
__________

سارا عالم ہے فدا جس پہ، جو رب کو بھایا
ہے حسین وہ نور مجسم سراپا تیرا
__________

سارے اصحاب ہدایت کے بنے ہیں تارے
کشتی نوح کی ہے مثل گھرانہ تیرا  
__________

میرے آلام کو آرام میں بدلا تو نے
جب بھی مشکل پڑی ، کام آیا سہارا تیرا
__________

دور ہو جائیں بلائیں، نہ کبھی پاس آئیں
چشم رحمت ہو تو محفوظ ہے بندہ تیرا
__________

فرق باطلہ کو دھول چٹائی جس نے
وہ رضا ہند میں ہے چاہنے والا تیرا
__________

لا نھر میں ہے بشارتؔ جو آئے، پائے
ہے یہ برہان بھی اک سائل و منگتا تیرا
`,
    },
    {
      id: 104,
      name: "میرے آقا کی ہے رحمت",
      lyrics: `میرے آقا کی ہے رحمت یہاں پر بھی وہاں پر بھی
مٹاتے ہیں ہر اک  کلفت یہاں پر بھی وہاں پر بھی
__________

عرب ہو یا عجم، عرض و سماں ہر جا میرے آقا
ہے جاری آپ کی مدحت یہاں پر بھی وہاں پر بھی
__________

یہ دنیا ہو یا ہو عقبیٰ، جدھر دیکھیں نظر آئے
انہی کی شان و شوکت یہاں پر بھی وہاں پر بھی
__________

ہیں وہ مملوک خالق کے، ہوۓ مالک جہاں بھر کے
ہے ملک مصطفی خلقت، یہاں پر بھی وہاں پر بھی
__________

گدا عطار کا ہوں، میں مرید غوث اعظم ہوں
سدا ملتی رہے برکت یہاں پر بھی وہاں پر بھی
__________

غلام عطار کا، احمد رضا کا اک سپاہی ہوں
سدا قائم رہے نسبت یہاں پر بھی وہاں پر بھی
__________

بچا لو قبر و محشر میں، عذاب و قہر سے آقا
کرو برہان کی نصرت یہاں پر بھی وہاں پر بھی
__________

نہ ہو مایوس اے برہانؔ ان کا فضل جاری ہے 
تجھے پہنچائیں گے رحمت یہاں پر بھی وہاں پر بھی`,
    },
    {
      id: 105,
      name: "محمد مصطفےٰ ﷺ تشریف لے آئے",
      lyrics: `محمد مصطفےٰ ﷺ صلِ علیٰ  تشریف لے آئے
زہے قسمت ہمارے پیشوا تشریف لے آئے
__________

افق کے گوشے گوشے سے اجالے کی کرن پھوٹی
طلوع صبح ہے شمس الضحیٰﷺ تشریف لے آئے
__________

عرب کے ریگزاروں میں عجم کی رہ گزاروں میں
چراغاں ہوگیا بدر الدجیٰ ﷺ تشریف لے آئے
__________

اٹھو اے عاصیو اور بڑھ کے دامن تھام لو ان کا
زمیں پر شافع ﷺ روز جزا تشریف لے آئے
__________

مکمل ہوگیا اب سلسلہ رشد و ہدایت کا
شہنشاہِ رسل نور الہدیٰ ﷺ تشریف لے آئے
__________

مبارک غم کے ماروں  کو مبارک خستہ خالوں کو
بالآخر مخزنﷺ جود و سخا تشریف لے آئے
__________

پسینہ آگیا بپھری ہوئی موجوں کو ہیبت سے
 شکستہ کشتیوں کے ناخدا تشریف لے آئے
__________

مقّدر جاگ اٹھااقبالؔ ہم سے بے سہاروں کا
شفیع المذنبین خیر الوریٰ ﷺ تشریف لے آئے`,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },
    {
      id: 1,
      name: "",
      lyrics: ``,
    },

    
    {
      id: 1,
      name: "",
      lyrics: ``,
    },

  ];

  // Find the song based on the ID from the route
  const song = songs.find((song) => song.id.toString() === id);

  const copyToClipboard = () => {
    if (song?.lyrics) {
      navigator.clipboard.writeText(song.lyrics).then(() => {
        setIsCopied(true);
        setTimeout(() => setIsCopied(false), 2000); // Reset after 2 seconds
      });
    }
  };

  const shareLyrics = async () => {
    if (navigator.share && song?.lyrics) {
      try {
        await navigator.share({
          title: song.name,
          text: song.lyrics,
          url: window.location.href,
        });
      } catch (error) {
        console.error("Sharing failed", error);
      }
    } else {
      alert("Sharing is not supported on this device.");
    }
  };

  return (
    <div className="min-h-screen bg-background p-4 font-urdu text-foreground">
      {/* Display the song name or a default message */}
      <div className="bg-white w-full h-auto rounded-lg border mb-4  shadow-lg">
        <h1 className="text-2xl text-center text-shadow-blueGlow text-blue-700 mt-2 underline  underline-offset-8 font-bold mb-4">
          {song?.name || "نامعلوم کلام"}
        </h1>
      </div>
      <div className="bg-foreground text-background p-4 rounded-md shadow-md bg-white md:text-2xl relative ">
        <pre className="font-urdu whitespace-pre-wrap text-center">
          {song?.lyrics || "شاعری دستیاب نہیں ہے۔"}
        </pre>
        <div className="mt-4 flex space-x-2 justify-center">
          {/* Copy Button */}
          <button
            onClick={copyToClipboard}
            className="bg-blue-500 text-white px-4 py-2 rounded-md shadow-md hover:bg-blue-600"
          >
            {isCopied ? "کاپی ہوگئی!" : "کاپی کریں"}
          </button>
          {/* Share Button */}
          <button
            onClick={shareLyrics}
            className="bg-green-500 text-white px-4 py-2 rounded-md shadow-md hover:bg-green-600"
          >
            شیئر کریں
          </button>
        </div>
      </div>
    </div>
  );
};

export default Lyrics;
